# Задание 1. Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

x = 5
y = 3
z = 8
print(x)
print(y)
print(z)

num_1 = int(input('введите значение первой переменной: '))
num_2 = int(input('введите значение второй переменной: '))
print(num_1)
print(num_2)
print('Cумма введенных переменных равна: ' + str(num_1 + num_2))
